Revit 2027 API
ScheduleField.IsCalculatedField Property
 Indicates if the field is a calculated field (Formula or Percentage).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCalculatedField { get; }
Public ReadOnly Property IsCalculatedField As Boolean
	Get
public:
property bool IsCalculatedField {
	bool get ();
}
member IsCalculatedField : bool with get
Property Value
Boolean
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace